{
  "auto_mapping": null,
  "base_model_name_or_path": "meta-llama/Llama-3.2-3B",
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 24,
  "num_layers": 28,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PROMPT_TUNING",
  "peft_version": "0.18.0",
  "prompt_tuning_init": "RANDOM",
  "prompt_tuning_init_text": null,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 3072,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "meta-llama/Llama-3.2-3B"
}